{
    "title": " Conditions générales d'utilisation",
    "p1": {
        "1": "En accédant au site web ",
        "2": ", vous acceptez d'être lié par les présentes conditions d'utilisation et par toutes les lois et réglementations applicables, et vous reconnaissez que vous êtes responsable du respect de toutes les lois locales applicables. Si vous n'acceptez pas l'une de ces conditions, il vous est interdit d'utiliser ou d'accéder à ce site. Les documents contenus dans ce site sont protégés par la législation applicable en matière de droits d'auteur et de marques commerciales."
    },
    "p2": {
        "1": "En aucun cas, ",
        "2": " ou ses fournisseurs ne peuvent être tenus responsables de dommages (y compris, sans limitation, les dommages pour perte de données ou de bénéfices, ou en raison d'une interruption d'activité) résultant de l'utilisation ou de l'incapacité à utiliser les éléments du site web ",
        "3": ", même si ",
        "4": " ou un représentant autorisé de ",
        "5": " a été informé oralement ou par écrit de la possibilité de tels dommages. Certaines juridictions n'autorisant pas les limitations de garanties implicites ou les limitations de responsabilité pour les dommages consécutifs ou accidentels, ces limitations peuvent ne pas s'appliquer à vous."
    },
    "p3": {
        "1": "Les éléments figurant sur le site web de ",
        "2": " peuvent contenir des erreurs techniques, typographiques ou photographiques. ",
        "3": " ne garantit pas que les éléments figurant sur son site web sont exacts, complets ou actuels. ",
        "4": " peut apporter des modifications aux informations contenues sur son site web à tout moment et sans préavis. Cependant,",
        "5": " ne s'engage pas à mettre à jour les matériaux."
    },
    "p4": {
        "1": " n'a pas vérifié tous les sites liés à son site web et n'est pas responsable du contenu de ces sites. L'inclusion d'un lien n'implique pas l'approbation du site par ",
        "2": ". L'utilisation de ces sites est aux risques et périls de l'utilisateur."
    },
    "p5": {
        "1": " peut réviser les présentes conditions d'utilisation de son site web à tout moment et sans préavis. En utilisant ce site web, vous acceptez d'être lié par la version en vigueur des présentes conditions d'utilisation."
    }
}